src/Reports/ОтчетОПрофессиональномОбучении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетОПрофессиональномОбучении</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановогоПовышенияКвалификации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОбучениеИПереподготовка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбучениеИПереподготовка</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаГраницей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПовышенияКвалификацииПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тематика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профессия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофессииРабочих</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОбОкончании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиДокументаОбОкончании</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражатьВТабеле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Reports/ОтчетОПрофессиональномОбучении/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда

	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокФлюрографии, ДокументРезультат)
	
	Пока ВыборкаСтрокФлюрографии.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокФлюрографии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокФлюрографии.ПодразделениеОрганизации Тогда			
			мНомер = 0;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизации.Код);
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации.Наименование;				
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
			
			Если ДатаПлановогоПовышенияКвалификации = Ложь Тогда
				ОбластьДетальныхЗаписей.Параметры.ТипОбучения = ВыборкаСтрокФлюрографии.ТипОбучения;
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокФлюрографии.ДатаНачала;
				ОбластьДетальныхЗаписей.Параметры.Специальность = ВыборкаСтрокФлюрографии.Специальность;
				ОбластьДетальныхЗаписей.Параметры.Тематика = ВыборкаСтрокФлюрографии.Тематика;
				ОбластьДетальныхЗаписей.Параметры.Профессия = ВыборкаСтрокФлюрографии.Профессия;
				ОбластьДетальныхЗаписей.Параметры.УчебноеЗаведение = ВыборкаСтрокФлюрографии.УчебноеЗаведение;
				ОбластьДетальныхЗаписей.Параметры.Разряд = ВыборкаСтрокФлюрографии.Разряд;
				ОбластьДетальныхЗаписей.Параметры.Стоимость = ВыборкаСтрокФлюрографии.Стоимость;
				ОбластьДетальныхЗаписей.Параметры.Период = ВыборкаСтрокФлюрографии.Период;

				ОбластьДетальныхЗаписей.Параметры.НомерПр = ?(Организация.ИНН = "700103211",ВыборкаСтрокФлюрографии.Регистратор.НомерПриказа,ВыборкаСтрокФлюрографии.Регистратор.Номер); //СВЭЙ 21.05.2024 КВВ СВФР-012926
				ОбластьДетальныхЗаписей.Параметры.ДатаПр = ?(Организация.ИНН = "700103211",ВыборкаСтрокФлюрографии.Регистратор.ДатаПриказа,ВыборкаСтрокФлюрографии.Регистратор.Дата); //СВЭЙ 21.05.2024 КВВ СВФР-012926
			Иначе 
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокФлюрографии.ДатаПовышенияКвалификацииПлановая;
			КонецЕсли;
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
			
		Иначе
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
			
			Если ДатаПлановогоПовышенияКвалификации = Ложь Тогда
				ОбластьДетальныхЗаписей.Параметры.ТипОбучения = ВыборкаСтрокФлюрографии.ТипОбучения;
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокФлюрографии.ДатаНачала;
				ОбластьДетальныхЗаписей.Параметры.Специальность = ВыборкаСтрокФлюрографии.Специальность;
				ОбластьДетальныхЗаписей.Параметры.Тематика = ВыборкаСтрокФлюрографии.Тематика;
				ОбластьДетальныхЗаписей.Параметры.Профессия = ВыборкаСтрокФлюрографии.Профессия;
				ОбластьДетальныхЗаписей.Параметры.УчебноеЗаведение = ВыборкаСтрокФлюрографии.УчебноеЗаведение;
				ОбластьДетальныхЗаписей.Параметры.Разряд = ВыборкаСтрокФлюрографии.Разряд;
				ОбластьДетальныхЗаписей.Параметры.Стоимость = ВыборкаСтрокФлюрографии.Стоимость;
				ОбластьДетальныхЗаписей.Параметры.Период = ВыборкаСтрокФлюрографии.Период;

				ОбластьДетальныхЗаписей.Параметры.НомерПр = ?(Организация.ИНН = "700103211",ВыборкаСтрокФлюрографии.Регистратор.НомерПриказа,ВыборкаСтрокФлюрографии.Регистратор.Номер); //СВЭЙ 21.05.2024 КВВ СВФР-012926
				ОбластьДетальныхЗаписей.Параметры.ДатаПр = ?(Организация.ИНН = "700103211",ВыборкаСтрокФлюрографии.Регистратор.ДатаПриказа,ВыборкаСтрокФлюрографии.Регистратор.Дата); //СВЭЙ 21.05.2024 КВВ СВФР-012926

			Иначе 
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокФлюрографии.ДатаПовышенияКвалификацииПлановая;
			КонецЕсли;
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
			
		КонецЕсли;
		
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	Если ДатаПлановогоПовышенияКвалификации = Ложь Тогда 
		мМакет = ПолучитьМакет("МакетПрофОбучение");
	Иначе
		мМакет = ПолучитьМакет("МакетПрофОбучениеПлановаое");
	конецесли;
	ТекПодр = "";

	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
	|	ОбучениеИПереподготовка.Сотрудник КАК Сотрудник,
	|	ОбучениеИПереподготовка.ТипОбучения,
	|	ОбучениеИПереподготовка.Специальность,
	|	ОбучениеИПереподготовка.Организация,
	|	ОбучениеИПереподготовка.ДатаНачала,
	|	ОбучениеИПереподготовка.ДатаПовышенияКвалификацииПлановая,
	|	ОбучениеИПереподготовка.Тематика КАК Тематика,
	|	ОбучениеИПереподготовка.Профессия КАК Профессия,
	|	ОбучениеИПереподготовка.УчебноеЗаведение КАК УчебноеЗаведение,
	|	ОбучениеИПереподготовка.Разряд КАК Разряд,
	|	ОбучениеИПереподготовка.Стоимость КАК Стоимость,
	|	ОбучениеИПереподготовка.Регистратор КАК Регистратор,
	|	ОбучениеИПереподготовка.Статус КАК Статус,
	|	ОбучениеИПереподготовка.Период
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбучениеИПереподготовка КАК ОбучениеИПереподготовка
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ОбучениеИПереподготовка.Сотрудник
	|	
	|ГДЕ
	|	ОбучениеИПереподготовка.ДатаНачала >= &ДатаНачала
	|	И ОбучениеИПереподготовка.ДатаНачала <= &ДатаОкончания
	|	//И ОбучениеИПереподготовка.ТипОбучения = &ТипОбучения
	|	И ОбучениеИПереподготовка.Организация = &Организация
	|	//1 И ОбучениеИПереподготовка.Специальность = &Специальность
	|	//И ОбучениеИПереподготовка.Статус = &Статус
	|	//И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)
	|	//И РаботникиОрганизацийСрезПоследних.Категория = &Категория //СВЭЙ 21.05.2024 КВВ СВФР-012926

	|
	|СГРУППИРОВАТЬ ПО
	|	ОбучениеИПереподготовка.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	ОбучениеИПереподготовка.Сотрудник,
	|	ОбучениеИПереподготовка.ТипОбучения,
	|	ОбучениеИПереподготовка.Специальность,
	|	ОбучениеИПереподготовка.ДатаНачала,
	|	ОбучениеИПереподготовка.ДатаПовышенияКвалификацииПлановая,
	|	ОбучениеИПереподготовка.Тематика,
	|	ОбучениеИПереподготовка.Профессия,
	|	ОбучениеИПереподготовка.УчебноеЗаведение,
	|	ОбучениеИПереподготовка.Разряд,
	|	ОбучениеИПереподготовка.Стоимость,
	|	ОбучениеИПереподготовка.Регистратор,
	|	ОбучениеИПереподготовка.Статус,
	|	ОбучениеИПереподготовка.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет Возр,
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
	Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
	Запрос.УстановитьПараметр("Организация",      Организация);

	Если ДатаПлановогоПовышенияКвалификации = Истина Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ОбучениеИПереподготовка.ДатаНачала >= &ДатаНачала","ОбучениеИПереподготовка.ДатаПовышенияКвалификацииПлановая >= &ДатаНачала");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ОбучениеИПереподготовка.ДатаНачала <= &ДатаОкончания","ОбучениеИПереподготовка.ДатаПовышенияКвалификацииПлановая <= &ДатаОкончания");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТипОбучения) тогда
		Запрос.УстановитьПараметр("ТипОбучения",      ТипОбучения);
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ОбучениеИПереподготовка.ТипОбучения = &ТипОбучения","И ОбучениеИПереподготовка.ТипОбучения = &ТипОбучения");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Специальность) тогда
		Запрос.УстановитьПараметр("Специальность",      Специальность);
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 И ОбучениеИПереподготовка.Специальность = &Специальность","И ОбучениеИПереподготовка.Специальность = &Специальность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Статус) тогда
		Запрос.УстановитьПараметр("Статус",      Статус);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ОбучениеИПереподготовка.Статус = &Статус","И ОбучениеИПереподготовка.Статус = &Статус");
	КонецЕсли;
	Если ЗначениеЗаполнено(Подразделение) Тогда 
		Запрос.УстановитьПараметр("Подразделение",      Подразделение);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)","И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)");
	КонецЕсли;
	
	//СВЭЙ 21.05.2024 КВВ СВФР-012926 (
	Если ЗначениеЗаполнено(Категория) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И РаботникиОрганизацийСрезПоследних.Категория = &Категория","И РаботникиОрганизацийСрезПоследних.Категория = &Категория");
		Запрос.УстановитьПараметр("Категория", Категория);
	КонецЕсли;
	//СВЭЙ 21.05.2024 КВВ СВФР-012926 )
	
	
	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

#КонецЕсли
